_posts/2016-03-31-how-to-write-first-paper.html
---
layout: post
title: "How to write your first paper"
date: 2016-03-31
comments: true
archive: true
notes: true
tags: notes
excerpt: Thoughts and notes regarding how to write your first paper by Jeff Leek.
---

<p>
Writing your first paper is a real important topic. I've recently come
across a nice article by <b>Jeff Leek</b> who explains this topic in a
really straight forward way <a href="https://github.com/jtleek/readingpapers">here</a>. In this blog post I am trying to
summarize the main points mostly to be used as a note reference to
myself. <b>Jeff</b> brakes it down into concrete steps as part of a
project. He starts by describing its <b>characteristics</b>:
</p>

<ol class="org-ol">
<li>It should be concrete</li>
<li>Should solve a scientific problem</li>
<li>Gives you the opportunity to learn something new</li>
<li>Something you feel ownership of</li>
<li>Something you want to work on</li>
</ol>

<p>
Having defined your problem next step is actually conducting the
research. Here <b>Jeff</b> suggests following the usual data analytic
process:
</p>

<ol class="org-ol">
<li>Define the question</li>
<li>Get/tidy the data</li>
<li>Explore the data</li>
<li>Build/borrow a model</li>
<li>Perform the analysis</li>
<li>Critique the results</li>
<li>Write the paper</li>
</ol>

<p>
As <b>Jeff</b> points out the <b><b>hardest part</b></b> is knowing <b>where to stop</b> and
<b>start writing</b>.
</p>

<p>
Don't strive for perfection not at least in the beginning! After all a
published paper is better than a non published one.
</p>

<p>
A result worth reporting ususally takes the form of between 1-5
figures showing a coherent story that you could explain to someone in
your field.
</p>

<p>
In a sense these are the steps involved in writing a paper:
</p>

<ol class="org-ol">
<li>Create 1-4 publication quality plots</li>
<li>Write a story in the simplest language for the plots while still
reporting all the technical details</li>
<li>Add references only after you have finished the whole first draft</li>
<li>Add in additional technical detail in the supplementary material if
needed be</li>
<li>Write up a reproducible version of your code that returns the
exactly same numbers/figures in your paper with no input
parameters needed</li>
</ol>
